# PyCity Schools Analysis

# The district schools have more students than charter schools. For this raeson it looks like the budget is higher.
# The charter schools show better performance based on the overall pasing rate.
# The charter schdools appears to be more focused on math while the district is on reading.
# The budget per student does not seems to be a factor to help in getting better performance.
# Above based on the top performing schools and the budget p/student.
# There is not that much fluctuation or difference in the scores between the different grades.

In [1]:
# Importing Dependencies
import pandas as pd
import numpy as np

In [2]:
# Assigning the path to our CSV files
file = "raw_data/schools_complete.csv"
file_2 = "raw_data/students_complete.csv"

In [3]:
# Read the School_Complete data into pandas
school = pd.read_csv(file)
school.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
students = pd.read_csv(file_2)
students.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
school = school.rename(columns={"name": "school"})
school.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
merged_df = pd.merge(school, students, on = "school")
merged_df.head()

,School ID,school,type,size,budget,Student ID,name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [7]:
merged_df.count()

School ID        39170
school           39170
type             39170
size             39170
budget           39170
Student ID       39170
name             39170
gender           39170
grade            39170
reading_score    39170
math_score       39170
dtype: int64

In [8]:
school.count()

School ID    15
school       15
type         15
size         15
budget       15
dtype: int64

In [9]:
students.count()

Student ID       39170
name             39170
gender           39170
grade            39170
school           39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
total_budget = school["budget"].sum()
total_budget

24649428

In [11]:
# getting the required data
student_in_school = pd.DataFrame(merged_df["school"].value_counts())
student_in_school

                       school
Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427

In [12]:
school_names = merged_df['school'].unique()
school_names

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [13]:
school_number = len(school_names)
school_number

15

In [14]:
total_students = students['name'].count()
total_students

39170

In [15]:
math_score_average = merged_df["math_score"].mean()
math_score_average

78.98537145774827

In [16]:
reading_score_average = merged_df["reading_score"].mean()
reading_score_average

81.87784018381414

In [17]:
# Amount of passing math scores (Above 70)
num_passing_math = students.loc[students['math_score'] >= 70]['math_score'].count()
percent_math_pass = num_passing_math/float(total_students) * 100
percent_math_pass

74.9808526933878

In [18]:
# Amount of passing reading scores (Above 70)
num_passing_read = students.loc[students['reading_score'] >= 70]['reading_score'].count()
percent_read_pass = num_passing_read/float(total_students) * 100
percent_read_pass

85.80546336482001

In [19]:
overall_passing_rate = (percent_math_pass + percent_read_pass) / 2
overall_passing_rate

80.39315802910392

In [20]:
# Creating a District summary DataFrame using above values
dist_summary_df = pd.DataFrame({"Total Schools" : [school_number],
                            "Total Students": [total_students],
                           "Total Budget": [total_budget],
                           "Average Math Score": [math_score_average],
                           "Average Reading Score": [reading_score_average],
                           "% Passing Math": [percent_math_pass],
                           "% Passing Reading": [percent_read_pass],     
                           "Overall Passing Rate": [overall_passing_rate]})


dist_summary_df

,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Overall Passing Rate,Total Budget,Total Schools,Total Students
0,74.980853,85.805463,78.985371,81.87784,80.393158,24649428,15,39170

In [21]:
# Create a different Data Frame so we can arrange the columns the way that it is required
district_summary = dist_summary_df[["Total Schools", "Total Students", "Total Budget", "Average Math Score", "Average Reading Score", 
                                 '% Passing Math', '% Passing Reading', 'Overall Passing Rate']]
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.393158

In [22]:
# Use Map to format all the columns
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)
district_summary["Average Math Score"] = district_summary["Average Math Score"].map("{:.6f}".format)

# District Summary

In [23]:
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,80.393158

In [24]:
# Group everything by School to be used for the School Summary
school_grouped = merged_df.set_index('school').groupby("school")
school_grouped
#.groupby(['school'])
#school_grouped.head()

In [25]:
# Obtain the school type (either District or Charter)
school_type = school.set_index('school') ['type']
school_type.head()

school
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Name: type, dtype: object

In [26]:
# Get students by School
students_per_school = school_grouped['Student ID'].count()
students_per_school

school
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: Student ID, dtype: int64

In [27]:
# Get budget by school
budget_per_school = school.set_index('school')['budget']
budget_per_school

school
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [28]:
# Get the amount of budget per student
student_budget = school.set_index('school')['budget'] / school.set_index('school')['size']
student_budget.head()

school
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
dtype: float64

In [29]:
# Obtain the Average Math & Reading Scores
school_average_math = school_grouped['math_score'].mean()
school_average_reading = school_grouped['reading_score'].mean()
school_average_reading

school
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [30]:
# Get the passing math % per school
school_passing_math = (merged_df[merged_df['math_score'] >= 70].groupby('school')['Student ID'].count() / students_per_school) * 100
school_passing_math

school
Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
Name: Student ID, dtype: float64

In [31]:
# Get the passing reading % per school
school_passing_reading = (merged_df[merged_df['reading_score'] >= 70].groupby('school')['Student ID'].count() / students_per_school) * 100
school_passing_reading

school
Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
Name: Student ID, dtype: float64

In [32]:
# Obtaining Overall Passing Rate per school
overall_pass_rate_school = (school_passing_math + school_passing_reading) / 2
overall_pass_rate_school

school
Bailey High School       74.306672
Cabrera High School      95.586652
Figueroa High School     73.363852
Ford High School         73.804308
Griffin High School      95.265668
Hernandez High School    73.807983
Holden High School       94.379391
Huang High School        73.500171
Johnson High School      73.639992
Pena High School         95.270270
Rodriguez High School    73.293323
Shelton High School      94.860875
Thomas High School       95.290520
Wilson High School       95.203679
Wright High School       94.972222
Name: Student ID, dtype: float64

In [33]:
# Creating the school summary DataFrame using above values
school_summary_df = pd.DataFrame({"School Type" : school_type,
                            "Total Students": students_per_school,
                           "Total School Budget": budget_per_school,
                           "Per Student Budget": student_budget,       
                           "Average Math Score": school_average_math,
                           "Average Reading Score": school_average_reading,
                           '% Passing Math': school_passing_math,
                           '% Passing Reading': school_passing_reading,     
                           "Overall Passing Rate": overall_pass_rate_school})

In [34]:
# Arranging the columns the way that it is required
school_summary_df = school_summary_df[['School Type', 'Total Students', 'Total School Budget',
                   'Per Student Budget', 'Average Math Score', 'Average Reading Score',
                   '% Passing Math', '% Passing Reading', 'Overall Passing Rate']]
school_summary_df

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,95.265668
Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,66.752967,80.862999,73.807983
Holden High School,Charter,427,248087,581.0,83.803279,83.814988,92.505855,96.252927,94.379391
Huang High School,District,2917,1910635,655.0,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,66.057551,81.222432,73.639992
Pena High School,Charter,962,585858,609.0,83.839917,84.044699,94.594595,95.945946,95.270270
Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,66.366592,80.220055,73.293323
Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,93.867121,95.854628,94.860875
Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,93.272171,97.308869,95.290520
Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,93.867718,96.539641,95.203679
Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,93.333333,96.611111,94.972222

# School Summary

In [35]:
# Format the columns
school_summary_df.style.format ({"Total School Budget" : "${:,.2f}",
                                "Per Student Budget" : "${:,.2f}"})

# Top Performing Schools (By Passing Rate)

In [36]:
# Sorting the data frame to obtain the top FIVE Overall Passing Rate Schools
top_five_schools = school_summary_df.sort_values('Overall Passing Rate', ascending=False)
top_five_schools.head(5).style.format ({"Total School Budget" : "${:,.2f}",
                                "Per Student Budget" : "${:,.2f}"})

# Bottom Performing Schools (By Passing Rate)

In [37]:
# Sorting the data frame to get the Bottom FIVE Performing Schools (By Passing Rate)
bottom_five_schools = school_summary_df.sort_values('Overall Passing Rate', ascending=True)
bottom_five_schools.head(5).style.format ({"Total School Budget" : "${:,.2f}",
                                "Per Student Budget" : "${:,.2f}"})

In [38]:
# Getting the Math Scores by Grade
math_nine = students.loc[students["grade"] == "9th"].groupby("school")["math_score"].mean()
math_ten = students.loc[students["grade"] == "10th"].groupby("school")["math_score"].mean()
math_eleven = students.loc[students["grade"] == "11th"].groupby("school")["math_score"].mean()
math_twelve = students.loc[students["grade"] == "12th"].groupby("school")["math_score"].mean()

In [39]:
# Create a DataFrame with above information and set the index to School
math_score_grade = pd.DataFrame({"9th" : math_nine, "10th" : math_ten, "11th" : math_eleven,
                            "12th" : math_twelve})
math_score_grade = math_score_grade[["9th", "10th", "11th", "12th"]]

# Math Scores by Grade

In [40]:
math_score_grade

                             9th       10th       11th       12th
school
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [41]:
# Getting the reading Scores by Grade
read_nine = students.loc[students["grade"] == "9th"].groupby("school")["reading_score"].mean()
read_ten = students.loc[students["grade"] == "10th"].groupby("school")["reading_score"].mean()
read_eleven = students.loc[students["grade"] == "11th"].groupby("school")["reading_score"].mean()
read_twelve = students.loc[students["grade"] == "12th"].groupby("school")["reading_score"].mean()

In [42]:
# Create a DataFrame with above information and set the index to School
read_score_grade = pd.DataFrame({"9th" : read_nine, "10th" : read_ten, "11th" : read_eleven,
                            "12th" : read_twelve})
read_score_grade = read_score_grade[["9th", "10th", "11th", "12th"]]

# Reading Scores by Grade

In [43]:
read_score_grade

                             9th       10th       11th       12th
school
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [44]:
# Create the bins in which Data will be held
# Bins are (0 < x <= $585), ($585 < x <= $615), ($615 < x <= $645), ($645 < x <= $675)
bins = [0, 584.999, 614.999 , 644.999, 999999]
group_bin = ["< $585", "$585-$615", "$615-$645","$645-$675"]
merged_df['spending_ranges'] = pd.cut(merged_df['budget']/merged_df['size'], bins, labels = group_bin)

In [45]:
# Grouping by Spending Bins
grp_by_spending = merged_df.groupby('spending_ranges')

In [46]:
# Calculate: Average Math Score // Average Reading Score // % Passing Math // % Passing Reading // 
# Overall Passing Rate BY SCHOOL SPENDING
ave_math = grp_by_spending['math_score'].mean()
ave_reading = grp_by_spending['reading_score'].mean()
pass_math = merged_df[merged_df['math_score'] >= 70].groupby('spending_ranges')['Student ID'].count() / grp_by_spending['Student ID'].count()*100
pass_read = merged_df[merged_df['reading_score'] >= 70].groupby('spending_ranges')['Student ID'].count() / grp_by_spending['Student ID'].count()*100
overall = (pass_math + pass_read) / 2

In [47]:
# Create the DataFrame to gatter the required information
score_by_spent = pd.DataFrame({
                            "Average Math Score": ave_math,
                            "Average Reading Score": ave_reading,
                            '% Passing Math': pass_math,
                            '% Passing Reading' : pass_read,
                            "Overall Passing Rate": overall
})

In [48]:
# Re-Order the Data Frame to match the requested format
score_by_spent = score_by_spent[[
                            "Average Math Score",
                            "Average Reading Score",
                            '% Passing Math',
                            '% Passing Reading',
                            "Overall Passing Rate"
]]

In [49]:
# Change the Index name to the one mentioned on the Example
score_by_spent.index.name = "Spending Ranges (Per Student)"
score_by_spent = score_by_spent.reindex(group_bin)

# Scores by School Spending

In [50]:
score_by_spent

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
Spending Ranges (Per Student),,,,,
< $585,83.363065,83.964039,93.702889,96.686558,95.194724
$585-$615,83.529196,83.838414,94.124128,95.886889,95.005509
$615-$645,78.061635,81.434088,71.400428,83.614770,77.507599
$645-$675,77.049297,81.005604,66.230813,81.109397,73.670105

In [51]:
# Create the bins in which Data will be held
# Bins are (0 < x < 999.99), (1000 < x < 1999.99), (2000 < x < 5000)
bins = [0, 999, 1999, 999999]
group_bin = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]
merged_df['school_size'] = pd.cut(merged_df['size'], bins, labels = group_bin)

In [52]:
# Group them by Spending again
grp_by_size = merged_df.groupby('school_size')

In [53]:
# Calculate: Average Math Score // Average Reading Score // % Passing Math // % Passing Reading // 
# Overall Passing Rate BY SCHOOL SIZE
ave_math = grp_by_size['math_score'].mean()
ave_reading = grp_by_size['reading_score'].mean()
pass_math = merged_df[merged_df['math_score'] >= 70].groupby('school_size')['Student ID'].count() / grp_by_size['Student ID'].count()*100
pass_read = merged_df[merged_df['reading_score'] >= 70].groupby('school_size')['Student ID'].count() / grp_by_size['Student ID'].count()*100
overall = (pass_math + pass_read) / 2

In [54]:
# Create the DataFrame to gatter the required information
score_by_size = pd.DataFrame({
                            "Average Math Score": ave_math,
                            "Average Reading Score": ave_reading,
                            '% Passing Math': pass_math,
                            '% Passing Reading' : pass_read,
                            "Overall Passing Rate": overall
})

In [55]:
# Re-Order the Data Frame to match the requested format
score_by_size = score_by_size[[
                            "Average Math Score",
                            "Average Reading Score",
                            '% Passing Math',
                            '% Passing Reading',
                            "Overall Passing Rate"
]]

In [56]:
# Change the Index name to the one mentioned on the Example
score_by_size.index.name = "School Size"
score_by_size = score_by_size.reindex(group_bin)

# Scores by School Size

In [57]:
score_by_size

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
School Size,,,,,
Small (<1000),83.828654,83.974082,93.952484,96.040317,94.996400
Medium (1000-2000),83.372682,83.867989,93.616522,96.773058,95.194790
Large (2000-5000),77.477597,81.198674,68.652380,82.125158,75.388769

In [58]:
# Repeat the breakdown, but group the schools based on school type (Charter vs. District)
# Now group by Type
grp_by_type = merged_df.groupby("type")

In [59]:
# Make the calcualtions but based on type
ave_math = grp_by_type['math_score'].mean()
ave_reading = grp_by_type['reading_score'].mean()
pass_math = merged_df[merged_df['math_score'] >= 70].groupby('type')['Student ID'].count() / grp_by_type['Student ID'].count()*100
pass_read = merged_df[merged_df['reading_score'] >= 70].groupby('type')['Student ID'].count() / grp_by_type['Student ID'].count()*100
overall = (pass_math + pass_read) / 2

In [60]:
# Create the DataFrame to gatter the required information
score_by_type = pd.DataFrame({
                            "Average Math Score": ave_math,
                            "Average Reading Score": ave_reading,
                            '% Passing Math': pass_math,
                            '% Passing Reading' : pass_read,
                            "Overall Passing Rate": overall
})

In [61]:
# Re-Order the Data Frame to match the requested format
score_by_type = score_by_type[[
                            "Average Math Score",
                            "Average Reading Score",
                            '% Passing Math',
                            '% Passing Reading',
                            "Overall Passing Rate"
]]

In [62]:
# Change the Index name to the one mentioned on the Example
score_by_type.index.name = "School Type"

# Scores by School Type

In [63]:
score_by_type

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
School Type,,,,,
Charter,83.406183,83.902821,93.701821,96.645891,95.173856
District,76.987026,80.962485,66.518387,80.905249,73.711818